Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: ولسليمان الريح عاصفة تجري بأمره إلى الأرض التي باركنا فيها وكنا بكل شيء عالمين
en: (It was Our power that made) the violent (unruly) wind flow (tamely) for Solomon, to his order, to the land which We had blessed: for We do know all things.

source: ومن الشياطين من يغوصون له ويعملون عملا دون ذلك وكنا لهم حافظين
en: And of the evil ones, were some who dived for him, and did other work besides; and it was We Who guarded them.

source: وأيوب إذ نادى ربه أني مسني الضر وأنت أرحم الراحمين
en: And (remember) Job, when He cried to his Lord, "Truly distress has seized me, but Thou art the Most Merciful of those that are merciful."

source: فاستجبنا له فكشفنا ما به من ضر وآتيناه أهله ومثلهم معهم رحمة من عندنا وذكرى للعابدين
en: So We listened to him: We removed the distress that was on him, and We restored his people to him, and doubled their number,- as a Grace from Ourselves, and a thing for commemoration, for all who serve Us.

source: وإسماعيل وإدريس وذا الكفل كل من الصابرين
en: And (remember) Isma'il, Idris, and Zul-kifl, all (men) of constancy and patience;

source: وأدخلناهم في رحمتنا إنهم من الصالحين
en: We admitted them to Our mercy: for they were of the righteous ones.

source: وذا النون إذ ذهب مغاضبا فظن أن لن نقدر عليه فنادى في الظلمات أن لا إله إلا أنت سبحانك إني كنت من الظالمين
en: And remember Zun-nun, when he departed in wrath: He imagined that We had no power over him! But he cried through the deptHs of darkness, "There is no god but thou: glory to thee: I was indeed wrong!"

source: فاستجبنا له ونجيناه من الغم وكذلك ننجي المؤمنين
en: So We listened to him: and delivered him from distress: and thus do We deliver those who have faith.

source: وزكريا إذ نادى ربه رب لا تذرني فردا وأنت خير الوارثين
en: And (remember) Zakariya, when he cried to his Lord: "O my Lord! leave me not without offspring, though thou art the best of inheritors."

source: فاستجبنا له ووهبنا له يحيى وأصلحنا له زوجه إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين
en: So We listened to him: and We granted him Yahya: We cured his wife's (Barrenness) for him. These (three) were ever quick in emulation in good works; they used to call on Us with love and reverence, and humble themselves before Us.

source: والتي أحصنت فرجها فنفخنا فيها من روحنا وجعلناها وابنها آية للعالمين
en: And (remember) her who guarded her chastity: We breathed into her of Our spirit, and We made her and her son a sign for all peoples.

source: إن هذه أمتكم أمة واحدة وأنا ربكم فاعبدون
en: Verily, this brotherhood of yours is a single brotherhood, and I am your Lord and Cherisher: therefore serve Me (and no other).

source: وتقطعوا أمرهم بينهم كل إلينا راجعون
en: But (later generations) cut off their affair (of unity), one from another: (yet) will they all return to Us.

source: فمن يعمل من الصالحات وهو مؤمن فلا كفران لسعيه وإنا له كاتبون
en: Whoever works any act of righteousness and has faith,- His endeavour will not be rejected: We shall record it in his favour.

source: وحرام على قرية أهلكناها أنهم لا يرجعون
en: But there is a ban on any population which We have destroyed: that they shall not return,

source: حتى إذا فتحت يأجوج ومأجوج وهم من كل حدب ينسلون
en: Until the Gog and Magog (people) are let through (their barrier), and they swiftly swarm from every hill.

source: واقترب الوعد الحق فإذا هي شاخصة أبصار الذين كفروا يا ويلنا قد كنا في غفلة من هذا بل كنا ظالمين
en: Then will the true promise draw nigh (of fulfilment): then behold! the eyes of the Unbelievers will fixedly stare in horror: "Ah! Woe to us! we were indeed heedless of this; nay, we truly did wrong!"

source: إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون
en: Verily ye, (unbelievers), and the (false) gods that ye worship besides Allah, are (but) fuel for Hell! to it will ye (surely) come!

source: لو كان هؤلاء آلهة ما وردوها وكل فيها خالدون
en: If these had been gods, they would not have got there! but each one will abide therein.

source: لهم فيها زفير وهم فيها لا يسمعون
en: There, sobbing will be their lot, nor will they there hear (aught else).

source: إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون
en: Those for whom the good (record) from Us has gone before, will be removed far therefrom.

source: لا يسمعون حسيسها وهم في ما اشتهت أنفسهم خالدون
en: Not the slightest sound will they hear of Hell: what their souls desired, in that will they dwell.

source: لا يحزنهم الفزع الأكبر وتتلقاهم الملائكة هذا يومكم الذي كنتم توعدون
en: The Great Terror will bring them no grief: but the angels will meet them (with mutual greetings): "This is your Day,- (the Day) that ye were promised."

source: يوم نطوي السماء كطي السجل للكتب كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين
en: The Day that We roll up the heavens like a scroll rolled up for books (completed),- even as We produced the first creation, so shall We produce a new one: a promise We have undertaken: truly shall We fulfil it.

source: ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون
en: Before this We wrote in the Psalms, after the Message (given to Moses): My servants the righteous, shall inherit the earth."

source: إن في هذا لبلاغا لقوم عابدين
en: Verily in this (Qur'an) is a Message for people who would (truly) worship Allah.

source: وما أرسلناك إلا رحمة للعالمين
en: We sent thee not, but as a Mercy for all creatures.

source: قل إنما يوحى إلي أنما إلهكم إله واحد فهل أنتم مسلمون
en: Say: "What has come to me by inspiration is that your Allah is One Allah: will ye therefore bow to His Will (in Islam)?"

source: فإن تولوا فقل آذنتكم على سواء وإن أدري أقريب أم بعيد ما توعدون
en: But if they turn back, Say: "I have proclaimed the Message to you all alike and in truth; but I know not whether that which ye are promised is near or far.

source: إنه يعلم الجهر من القول ويعلم ما تكتمون
en: "It is He Who knows what is open in speech and what ye hide (in your hearts).

source: وإن أدري لعله فتنة لكم ومتاع إلى حين
en: "I know not but that it may be a trial for you, and a grant of (worldly) livelihood (to you) for a time."

source: قال رب احكم بالحق وربنا الرحمن المستعان على ما تصفون
en: Say: "O my Lord! judge Thou in truth!" "Our Lord Most Gracious is the One Whose assistance should be sought against the blasphemies ye utter!"

source: يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم
en: O mankind! fear your Lord! for the convulsion of the Hour (of Judgment) will be a thing terrible!

source: يوم ترونها تذهل كل مرضعة عما أرضعت وتضع كل ذات حمل حملها وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد
en: The Day ye shall see it, every mother giving suck shall forget her suckling-babe, and every pregnant female shall drop her load (unformed): thou shalt see mankind as in a drunken riot, yet not drunk: but dreadful will be the Wrath of Allah.

source: ومن الناس من يجادل في الله بغير علم ويتبع كل شيطان مريد
en: And yet among men there are such as dispute about Allah, without knowledge, and follow every evil one obstinate in rebellion!

source: كتب عليه أنه من تولاه فأنه يضله ويهديه إلى عذاب السعير
en: About the (Evil One) it is decreed that whoever turns to him for friendship, him will he lead astray, and he will guide him to the Penalty of the Fire.

source: يا أيها الناس إن كنتم في ريب من البعث فإنا خلقناكم من تراب ثم من نطفة ثم من علقة ثم من مضغة مخلقة وغير مخلقة لنبين لكم ونقر في الأرحام ما نشاء إلى أجل مسمى ثم نخرجكم طفلا ثم لتبلغوا أشدكم ومنكم من يتوفى ومنكم من يرد إلى أرذل العمر لكيلا يعلم من بعد علم شيئا وترى الأرض هامدة فإذا أنزلنا عليها الماء اهتزت وربت وأنبتت من كل زوج بهيج
en: O mankind! if ye have a doubt about the Resurrection, (consider) that We created you out of dust, then out of sperm, then out of a leech-like clot, then out of a morsel of flesh, partly formed and partly unformed, in order that We may manifest (our power) to you; and We cause whom We will to rest in the wombs for an appointed term, then do We bring you out as babes, then (foster you) that ye may reach your age of full strength; and some of you are called to die, and some are sent back to the feeblest old age, so that they know nothing after having known (much), and (further), thou seest the earth barren and lifeless, but when We pour down rain on it, it is stirred (to life), it swells, and it puts forth every kind of beautiful growth (in pairs).

source: ذلك بأن الله هو الحق وأنه يحيي الموتى وأنه على كل شيء قدير
en: This is so, because Allah is the Reality: it is He Who gives life to the dead, and it is He Who has power over all things.

source: وأن الساعة آتية لا ريب فيها وأن الله يبعث من في القبور
en: And verily the Hour will come: there can be no doubt about it, or about (the fact) that Allah will raise up all who are in the graves.

source: ومن الناس من يجادل في الله بغير علم ولا هدى ولا كتاب منير
en: Yet there is among men such a one as disputes about Allah, without Knowledge, without Guidance, and without a Book of Enlightenment,-

source: ثاني عطفه ليضل عن سبيل الله له في الدنيا خزي ونذيقه يوم القيامة عذاب الحريق
en: (Disdainfully) bending his side, in order to lead (men) astray from the Path of Allah: for him there is disgrace in this life, and on the Day of Judgment We shall make him taste the Penalty of burning (Fire).

source: ذلك بما قدمت يداك وأن الله ليس بظلام للعبيد
en: (It will be said): "This is because of the deeds which thy hands sent forth, for verily Allah is not unjust to His servants.

source: ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ذلك هو الخسران المبين
en: There are among men some who serve Allah, as it were, on the verge: if good befalls them, they are, therewith, well content; but if a trial comes to them, they turn on their faces: they lose both this world and the Hereafter: that is loss for all to see!

source: يدعو من دون الله ما لا يضره وما لا ينفعه ذلك هو الضلال البعيد
en: They call on such deities, besides Allah, as can neither hurt nor profit them: that is straying far indeed (from the Way)!

source: يدعو لمن ضره أقرب من نفعه لبئس المولى ولبئس العشير
en: (Perhaps) they call on one whose hurt is nearer than his profit: evil, indeed, is the patron, and evil the companion (or help)!

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار إن الله يفعل ما يريد
en: Verily Allah will admit those who believe and work righteous deeds, to Gardens, beneath which rivers flow: for Allah carries out all that He plans.

source: من كان يظن أن لن ينصره الله في الدنيا والآخرة فليمدد بسبب إلى السماء ثم ليقطع فلينظر هل يذهبن كيده ما يغيظ
en: If any think that Allah will not help him (His Messenger) in this world and the Hereafter, let him stretch out a rope to the ceiling and cut (himself) off: then let him see whether his plan will remove that which enrages (him)!

source: وكذلك أنزلناه آيات بينات وأن الله يهدي من يريد
en: Thus have We sent down Clear Signs; and verily Allah doth guide whom He will!

source: إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد
en: Those who believe (in the Qur'an), those who follow the Jewish (scriptures), and the Sabians, Christians, Magians, and Polytheists,- Allah will judge between them on the Day of Judgment: for Allah is witness of all things.

source: ألم تر أن الله يسجد له من في السماوات ومن في الأرض والشمس والقمر والنجوم والجبال والشجر والدواب وكثير من الناس وكثير حق عليه العذاب ومن يهن الله فما له من مكرم إن الله يفعل ما يشاء
en: Seest thou not that to Allah bow down in worship all things that are in the heavens and on earth,- the sun, the moon, the stars; the hills, the trees, the animals; and a great number among mankind? But a great number are (also) such as are fit for Punishment: and such as Allah shall disgrace,- None can raise to honour: for Allah carries out all that He wills.

source: هذان خصمان اختصموا في ربهم فالذين كفروا قطعت لهم ثياب من نار يصب من فوق رءوسهم الحميم
en: These two antagonists dispute with each other about their Lord: But those who deny (their Lord),- for them will be cut out a garment of Fire: over their heads will be poured out boiling water.

source: يصهر به ما في بطونهم والجلود
en: With it will be scalded what is within their bodies, as well as (their) skins.

source: ولهم مقامع من حديد
en: In addition there will be maces of iron (to punish) them.

source: كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها وذوقوا عذاب الحريق
en: Every time they wish to get away therefrom, from anguish, they will be forced back therein, and (it will be said), "Taste ye the Penalty of Burning!"

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: Allah will admit those who believe and work righteous deeds, to Gardens beneath which rivers flow: they shall be adorned therein with bracelets of gold and pearls; and their garments there will be of silk.

source: وهدوا إلى الطيب من القول وهدوا إلى صراط الحميد
en: For they have been guided (in this life) to the purest of speeches; they have been guided to the Path of Him Who is Worthy of (all) Praise.

source: إن الذين كفروا ويصدون عن سبيل الله والمسجد الحرام الذي جعلناه للناس سواء العاكف فيه والباد ومن يرد فيه بإلحاد بظلم نذقه من عذاب أليم
en: As to those who have rejected (Allah), and would keep back (men) from the Way of Allah, and from the Sacred Mosque, which We have made (open) to (all) men - equal is the dweller there and the visitor from the country - and any whose purpose therein is profanity or wrong-doing - them will We cause to taste of a most Grievous Penalty.

source: وإذ بوأنا لإبراهيم مكان البيت أن لا تشرك بي شيئا وطهر بيتي للطائفين والقائمين والركع السجود
en: Behold! We gave the site, to Abraham, of the (Sacred) House, (saying): "Associate not anything (in worship) with Me; and sanctify My House for those who compass it round, or stand up, or bow, or prostrate themselves (therein in prayer).

source: وأذن في الناس بالحج يأتوك رجالا وعلى كل ضامر يأتين من كل فج عميق
en: "And proclaim the Pilgrimage among men: they will come to thee on foot and (mounted) on every kind of camel, lean on account of journeys through deep and distant mountain highways;

source: ليشهدوا منافع لهم ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام فكلوا منها وأطعموا البائس الفقير
en: "That they may witness the benefits (provided) for them, and celebrate the name of Allah, through the Days appointed, over the cattle which He has provided for them (for sacrifice): then eat ye thereof and feed the distressed ones in want.

source: ثم ليقضوا تفثهم وليوفوا نذورهم وليطوفوا بالبيت العتيق
en: "Then let them complete the rites prescribed for them, perform their vows, and (again) circumambulate the Ancient House."

source: ذلك ومن يعظم حرمات الله فهو خير له عند ربه وأحلت لكم الأنعام إلا ما يتلى عليكم فاجتنبوا الرجس من الأوثان واجتنبوا قول الزور
en: Such (is the Pilgrimage): whoever honours the sacred rites of Allah, for him it is good in the Sight of his Lord. Lawful to you (for food in Pilgrimage) are cattle, except those mentioned to you (as exception): but shun the abomination of idols, and shun the word that is false,-

source: حنفاء لله غير مشركين به ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوي به الريح في مكان سحيق
en: Being true in faith to Allah, and never assigning partners to Him: if anyone assigns partners to Allah, is as if he had fallen from heaven and been snatched up by birds, or the wind had swooped (like a bird on its prey) and thrown him into a far-distant place.

source: ذلك ومن يعظم شعائر الله فإنها من تقوى القلوب
en: Such (is his state): and whoever holds in honour the symbols of Allah, (in the sacrifice of animals), such (honour) should come truly from piety of heart.

source: لكم فيها منافع إلى أجل مسمى ثم محلها إلى البيت العتيق
en: In them ye have benefits for a term appointed: in the end their place of sacrifice is near the Ancient House.

source: ولكل أمة جعلنا منسكا ليذكروا اسم الله على ما رزقهم من بهيمة الأنعام فإلهكم إله واحد فله أسلموا وبشر المخبتين
en: To every people did We appoint rites (of sacrifice), that they might celebrate the name of Allah over the sustenance He gave them from animals (fit for food). But your god is One God: submit then your wills to Him (in Islam): and give thou the good news to those who humble themselves,-

source: الذين إذا ذكر الله وجلت قلوبهم والصابرين على ما أصابهم والمقيمي الصلاة ومما رزقناهم ينفقون
en: To those whose hearts when Allah is mentioned, are filled with fear, who show patient perseverance over their afflictions, keep up regular prayer, and spend (in charity) out of what We have bestowed upon them.

source: والبدن جعلناها لكم من شعائر الله لكم فيها خير فاذكروا اسم الله عليها صواف فإذا وجبت جنوبها فكلوا منها وأطعموا القانع والمعتر كذلك سخرناها لكم لعلكم تشكرون
en: The sacrificial camels we have made for you as among the symbols from Allah: in them is (much) good for you: then pronounce the name of Allah over them as they line up (for sacrifice): when they are down on their sides (after slaughter), eat ye thereof, and feed such as (beg not but) live in contentment, and such as beg with due humility: thus have We made animals subject to you, that ye may be grateful.

source: لن ينال الله لحومها ولا دماؤها ولكن يناله التقوى منكم كذلك سخرها لكم لتكبروا الله على ما هداكم وبشر المحسنين
en: It is not their meat nor their blood, that reaches Allah: it is your piety that reaches Him: He has thus made them subject to you, that ye may glorify Allah for His Guidance to you and proclaim the good news to all who do right.

source: إن الله يدافع عن الذين آمنوا إن الله لا يحب كل خوان كفور
en: Verily Allah will defend (from ill) those who believe: verily, Allah loveth not any that is a traitor to faith, or show ingratitude.

source: أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير
en: To those against whom war is made, permission is given (to fight), because they are wronged;- and verily, Allah is most powerful for their aid;-

source: الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ولينصرن الله من ينصره إن الله لقوي عزيز
en: (They are) those who have been expelled from their homes in defiance of right,- (for no cause) except that they say, "our Lord is Allah". Did not Allah check one set of people by means of another, there would surely have been pulled down monasteries, churches, synagogues, and mosques, in which the name of Allah is commemorated in abundant measure. Allah will certainly aid those who aid his (cause);- for verily Allah is full of Strength, Exalted in Might, (able to enforce His Will).

source: الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر ولله عاقبة الأمور
en: (They are) those who, if We establish them in the land, establish regular prayer and give regular charity, enjoin the right and forbid wrong: with Allah rests the end (and decision) of (all) affairs.

source: وإن يكذبوك فقد كذبت قبلهم قوم نوح وعاد وثمود
en: If they treat thy (mission) as false, so did the peoples before them (with their prophets),- the People of Noah, and 'Ad and Thamud;

source: وقوم إبراهيم وقوم لوط
en: Those of Abraham and Lut;

source: وأصحاب مدين وكذب موسى فأمليت للكافرين ثم أخذتهم فكيف كان نكير
en: And the Companions of the Madyan People; and Moses was rejected (in the same way). But I granted respite to the Unbelievers, and (only) after that did I punish them: but how (terrible) was my rejection (of them)!

source: فكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد
en: How many populations have We destroyed, which were given to wrong-doing? They tumbled down on their roofs. And how many wells are lying idle and neglected, and castles lofty and well-built?

source: أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور
en: Do they not travel through the land, so that their hearts (and minds) may thus learn wisdom and their ears may thus learn to hear? Truly it is not their eyes that are blind, but their hearts which are in their breasts.

source: ويستعجلونك بالعذاب ولن يخلف الله وعده وإن يوما عند ربك كألف سنة مما تعدون
en: Yet they ask thee to hasten on the Punishment! But Allah will not fail in His Promise. Verily a Day in the sight of thy Lord is like a thousand years of your reckoning.

source: وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير
en: And to how many populations did I give respite, which were given to wrong-doing? in the end I punished them. To me is the destination (of all).

source: قل يا أيها الناس إنما أنا لكم نذير مبين
en: Say: "O men! I am (sent) to you only to give a Clear Warning:

source: فالذين آمنوا وعملوا الصالحات لهم مغفرة ورزق كريم
en: "Those who believe and work righteousness, for them is forgiveness and a sustenance most generous.

source: والذين سعوا في آياتنا معاجزين أولئك أصحاب الجحيم
en: "But those who strive against Our Signs, to frustrate them,- they will be Companions of the Fire."

source: وما أرسلنا من قبلك من رسول ولا نبي إلا إذا تمنى ألقى الشيطان في أمنيته فينسخ الله ما يلقي الشيطان ثم يحكم الله آياته والله عليم حكيم
en: Never did We send a messenger or a prophet before thee, but, when he framed a desire, Satan threw some (vanity) into his desire: but Allah will cancel anything (vain) that Satan throws in, and Allah will confirm (and establish) His Signs: for Allah is full of Knowledge and Wisdom:

source: ليجعل ما يلقي الشيطان فتنة للذين في قلوبهم مرض والقاسية قلوبهم وإن الظالمين لفي شقاق بعيد
en: That He may make the suggestions thrown in by Satan, but a trial for those in whose hearts is a disease and who are hardened of heart: verily the wrong-doers are in a schism far (from the Truth):

source: وليعلم الذين أوتوا العلم أنه الحق من ربك فيؤمنوا به فتخبت له قلوبهم وإن الله لهاد الذين آمنوا إلى صراط مستقيم
en: And that those on whom knowledge has been bestowed may learn that the (Qur'an) is the Truth from thy Lord, and that they may believe therein, and their hearts may be made humbly (open) to it: for verily Allah is the Guide of those who believe, to the Straight Way.

source: ولا يزال الذين كفروا في مرية منه حتى تأتيهم الساعة بغتة أو يأتيهم عذاب يوم عقيم
en: Those who reject Faith will not cease to be in doubt concerning (Revelation) until the Hour (of Judgment) comes suddenly upon them, or there comes to them the Penalty of a Day of Disaster.

source: الملك يومئذ لله يحكم بينهم فالذين آمنوا وعملوا الصالحات في جنات النعيم
en: On that Day of Dominion will be that of Allah: He will judge between them: so those who believe and work righteous deeds will be in Gardens of Delight.

source: والذين كفروا وكذبوا بآياتنا فأولئك لهم عذاب مهين
en: And for those who reject Faith and deny our Signs, there will be a humiliating Punishment.

source: والذين هاجروا في سبيل الله ثم قتلوا أو ماتوا ليرزقنهم الله رزقا حسنا وإن الله لهو خير الرازقين
en: Those who leave their homes in the cause of Allah, and are then slain or die,- On them will Allah bestow verily a goodly Provision: Truly Allah is He Who bestows the best provision.

source: ليدخلنهم مدخلا يرضونه وإن الله لعليم حليم
en: Verily He will admit them to a place with which they shall be well pleased: for Allah is All-Knowing, Most Forbearing.

source: ذلك ومن عاقب بمثل ما عوقب به ثم بغي عليه لينصرنه الله إن الله لعفو غفور
en: That (is so). And if one has retaliated to no greater extent than the injury he received, and is again set upon inordinately, Allah will help him: for Allah is One that blots out (sins) and forgives (again and again).

source: ذلك بأن الله يولج الليل في النهار ويولج النهار في الليل وأن الله سميع بصير
en: That is because Allah merges night into day, and He merges day into night, and verily it is Allah Who hears and sees (all things).
